# Warehouse ETL

In [1]:
%load_ext sql
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

In [2]:
%%sql
attach Database 'CourseData.db' AS DB

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [3]:
%%sql
SELECT *
FROM DB.LOCATIONS
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'BCC 200'), (2, 'BD '), (3, 'BH '), (4, 'BH BY ARR'), (5, 'BLM 112')]

# Create Tables

In [4]:
%%sql

DROP TABLE IF EXISTS PROGRAMS_DW;
DROP TABLE IF EXISTS PROFESSORS_DW;
DROP TABLE IF EXISTS LOCATIONS_DW;
DROP TABLE IF EXISTS TIMECODES_DW;
DROP TABLE IF EXISTS COURSES_DW;
DROP TABLE IF EXISTS CLASS_FACTS_DW;

 * sqlite:///CourseDataWarehouse.db
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [5]:
%%sql

CREATE TABLE PROGRAMS_DW (
    Program_id INTEGER PRIMARY KEY,
    program_code TEXT NOT NULL,
    program_name TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [6]:
%%sql

CREATE TABLE PROFESSORS_DW (
    Professor_id INTEGER PRIMARY KEY,
    Name TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [7]:
%%sql

CREATE TABLE LOCATIONS_DW (
    Location_id INTEGER PRIMARY KEY,
    location TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [8]:
%%sql

CREATE TABLE TIMECODES_DW (
    Timecode_id INTEGER PRIMARY KEY,
    Day TEXT,
    Start TEXT NOT NULL,
    End TEXT NOT NULL
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [9]:
%%sql

CREATE TABLE COURSES_DW (
    Course_id INTEGER PRIMARY KEY, 
    CatalogYear TEXT NOT NULL,
    Catalog_id TEXT NOT NULL,
    Course_title TEXT NOT NULL,
    Credits TEXT NOT NULL,
    Program_id INTEGER,
    FOREIGN KEY (Program_id) REFERENCES PROGRAMS_DW(Program_id)
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

In [10]:
%%sql

CREATE TABLE CLASS_FACTS_DW (
    Course_id INTEGER,
    Program_id INTEGER,
    Location_id INTEGER,
    Professor_id INTEGER,
    Offering_id INTEGER,
    Timecode_id INTEGER,
    CatalogYear TEXT NOT NULL,
    Term TEXT NOT NULL,
    Credits REAL,
    Section TEXT NOT NULL,
    Cap INTEGER NOT NULL,
    Actual INTEGER NOT NULL,
    Remaining INTEGER NOT NULL,
    Timecodes TEXT,
    Count_courses INTEGER,
    Num_students INTEGER,
    Count_location INTEGER,
    FOREIGN KEY (Timecode_id) REFERENCES TIMECODES_DW(Timecode_id),
    FOREIGN KEY (Course_id) REFERENCES COURSES_DW(Course_id),
    FOREIGN KEY (Program_id) REFERENCES PROGRAMS_DW(Program_id),
    FOREIGN KEY (Location_id) REFERENCES LOCATIONS_DW(Location_id),
    FOREIGN KEY (Professor_id) REFERENCES PROFESSORS_DW(Professor_id)   
);

 * sqlite:///CourseDataWarehouse.db
Done.

[]

# POPULATE TABLES

In [11]:
%%sql

INSERT INTO PROGRAMS_DW(program_name,program_code)
    SELECT DISTINCT program_name,program_code
    FROM DB.PROGRAMS;
SELECT * FROM PROGRAMS_DW LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
83 rows affected.
Done.

[(1, 'AC', 'Accounting'),
 (2, 'AE', 'Applied Ethics'),
 (3, 'AH', 'Art History'),
 (4, 'AN', 'Asian Studies'),
 (5, 'AR', 'Arabic')]

In [12]:
%%sql

INSERT INTO PROFESSORS_DW(Name)
    SELECT DISTINCT Name
    FROM DB.PROFESSORS;
SELECT * FROM PROFESSORS_DW LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
1104 rows affected.
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

In [13]:
%%sql

INSERT INTO LOCATIONS_DW(location)
    SELECT location
    FROM DB.LOCATIONS;
SELECT * FROM LOCATIONS_DW LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
207 rows affected.
Done.

[(1, 'BCC 200'), (2, 'BD '), (3, 'BH '), (4, 'BH BY ARR'), (5, 'BLM 112')]

In [14]:
%%sql

INSERT INTO COURSES_DW(CatalogYear,Catalog_id,Course_title,Credits, Program_id)
    SELECT DISTINCT CatalogYear,Catalog_id,Course_title,Credits, Program_id
    FROM DB.COURSES;
SELECT * FROM COURSES_DW LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
4440 rows affected.
Done.

[(1, '2017_2018', 'AN 0301', 'Independent Study', '1-3 Credits', 4),
 (2, '2017_2018', 'AN 0310', 'Asian Studies Seminar', '3 Credits', 4),
 (3, '2017_2018', 'BU 0211', 'Legal Environment of Business', '3 Credits', 12),
 (4, '2017_2018', 'BU 0220', 'Environmental Law and Policy', '3 Credits', 12),
 (5, '2017_2018', 'BU 0311', 'The Law of Contracts, Sales, and Property', '3 Credits', 12),
 (6, '2017_2018', 'BU 0312', 'The Law of Business Organizations and Financial Transactions', '3 Credits', 12),
 (7, '2017_2018', 'BU 0320', 'Employment Law and Discrimination in the Workplace', '3 Credits', 12),
 (8, '2017_2018', 'BU 0391', 'Seminar in Business Law and Ethics', '3 Credits', 12),
 (9, '2017_2018', 'BL 0101', 'Black Lives Matter', '3 Credits', 11),
 (10, '2017_2018', 'BL 0398', 'Independent Study', '1-3 Credits', 11)]

In [15]:
%%sql
DELETE FROM TIMECODES_DW;
INSERT INTO TIMECODES_DW(Day,Start,End)
    SELECT DISTINCT Day,time(Start) AS StartTime,time(End) AS EndTime
    FROM DB.MEETINGS
    ORDER BY Day, StartTime, EndTime;
SELECT * FROM TIMECODES_DW LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
0 rows affected.
1090 rows affected.
Done.

[(1, 'F', '07:00:00', '10:00:00'),
 (2, 'F', '07:00:00', '11:00:00'),
 (3, 'F', '07:00:00', '12:15:00'),
 (4, 'F', '07:00:00', '13:00:00'),
 (5, 'F', '07:00:00', '14:00:00'),
 (6, 'F', '07:00:00', '15:00:00'),
 (7, 'F', '07:00:00', '17:30:00'),
 (8, 'F', '07:45:00', '10:15:00'),
 (9, 'F', '07:55:00', '10:55:00'),
 (10, 'F', '08:00:00', '08:30:00')]

In [16]:
%%sql
DROP TABLE IF EXISTS OFFERING_TIMECODE;
CREATE TABLE OFFERING_TIMECODE AS

SELECT DISTINCT Day,time(DB.MEETINGS.Start) AS StartTime,time(DB.MEETINGS.End) AS EndTime, Offering_id,Timecode_id
    FROM DB.MEETINGS
    JOIN DB.COURSE_OFFERINGS USING(Offering_id)
    JOIN TIMECODES_DW USING(Day)
    WHERE TIMECODES_DW.Day = Day AND TIMECODES_DW.Start = StartTime AND TIMECODES_DW.End = EndTime
    ORDER BY Day, StartTime, EndTime;
SELECT * FROM OFFERING_TIMECODE LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.
Done.
Done.

[('F', '07:00:00', '10:00:00', 15426, 1),
 ('F', '07:00:00', '11:00:00', 15426, 2),
 ('F', '07:00:00', '12:15:00', 8479, 3),
 ('F', '07:00:00', '12:15:00', 9905, 3),
 ('F', '07:00:00', '12:15:00', 11338, 3),
 ('F', '07:00:00', '12:15:00', 11339, 3),
 ('F', '07:00:00', '13:00:00', 1074, 4),
 ('F', '07:00:00', '13:00:00', 2587, 4),
 ('F', '07:00:00', '13:00:00', 2591, 4),
 ('F', '07:00:00', '13:00:00', 4079, 4)]

In [17]:
%%sql

INSERT INTO CLASS_FACTS_DW(Course_id,Program_id,Location_id,Professor_id,Timecode_id,Offering_id,CatalogYear,Term,Credits,Section,Cap,Actual,Remaining,Timecodes)
    SELECT DISTINCT Course_id,Program_id,Location_id,Professor_id,Timecode_id,DB.COURSE_OFFERINGS.Offering_id,COURSES_DW.CatalogYear, DB.COURSE_OFFERINGS.Term, DB.COURSE_OFFERINGS.Credits, DB.COURSE_OFFERINGS.Section, DB.COURSE_OFFERINGS.Cap, DB.COURSE_OFFERINGS.Actual, DB.COURSE_OFFERINGS.Remaining, DB.COURSE_OFFERINGS.Timecodes
    FROM DB.MEETINGS
        JOIN DB.COURSE_OFFERINGS USING (Offering_id)
        JOIN COURSES_DW USING(Course_id)
        JOIN PROGRAMS_DW USING(Program_id)
        JOIN LOCATIONS_DW USING(Location_id)
        JOIN PROFESSORS_DW USING(Professor_id)
        JOIN OFFERING_TIMECODE USING(Offering_id)
        JOIN TIMECODES_DW USING(Timecode_id);
SELECT * FROM CLASS_FACTS_DW LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
10316 rows affected.
Done.

[(113, 1, 105, 2, 4489, 207, '2017_2018', 'Fall2017', 3.0, '01C', 0, 28, -28, "['MR 1100am-1215pm 09/05-12/11 DSB 110A']", None, None, None),
 (113, 1, 105, 2, 4489, 404, '2017_2018', 'Fall2017', 3.0, '01C', 0, 28, -28, "['MR 1100am-1215pm 09/05-12/11 DSB 110A']", None, None, None),
 (113, 1, 105, 2, 4490, 218, '2017_2018', 'Fall2017', 3.0, '02C', 0, 29, -29, "['MR 1230pm-0145pm 09/05-12/11 DSB 110A']", None, None, None),
 (113, 1, 105, 2, 4490, 413, '2017_2018', 'Fall2017', 3.0, '02C', 0, 29, -29, "['MR 1230pm-0145pm 09/05-12/11 DSB 110A']", None, None, None),
 (113, 1, 98, 690, 4491, 147, '2017_2018', 'Fall2017', 3.0, '03C', 0, 26, -26, "['MR 0800am-0915am 09/05-12/11 DSB 104']", None, None, None),
 (113, 1, 98, 690, 4491, 343, '2017_2018', 'Fall2017', 3.0, '03C', 0, 26, -26, "['MR 0800am-0915am 09/05-12/11 DSB 104']", None, None, None),
 (113, 1, 98, 690, 4492, 186, '2017_2018', 'Fall2017', 3.0, '04C', 0, 30, -30, "['MR 0930am-1045am 09/05-12/11 DSB 104']", None, None, None),
 (113, 1, 98, 690, 4492, 385, '2017_2018', 'Fall2017', 3.0, '04C', 0, 30, -30, "['MR 0930am-1045am 09/05-12/11 DSB 104']", None, None, None),
 (113, 1, 98, 690, 4493, 243, '2017_2018', 'Fall2017', 3.0, '05C', 0, 31, -31, "['MR 0200pm-0315pm 09/05-12/11 DSB 104']", None, None, None),
 (113, 1, 98, 690, 4493, 435, '2017_2018', 'Fall2017', 3.0, '05C', 0, 31, -31, "['MR 0200pm-0315pm 09/05-12/11 DSB 104']", None, None, None)]

# STEP 5: CLEAR AND REGAIN STORAGE

In [18]:
%%sql
vacuum;

 * sqlite:///CourseDataWarehouse.db
Done.

[]